### Домашнее задание «Библиотека Pandas»
А.Петряшев (DS-28)

In [12]:
import pandas as pd

Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [66]:
ratings = pd.read_csv('ml-latest-small/ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [135]:
rating_numbers = ratings[ratings.rating == 5][['movieId', 'rating']].groupby('movieId').count().sort_values('rating', ascending=False)

In [145]:
rating_numbers.reset_index().head()
#rating_numbers.index[0]

   movieId  rating
0      318     153
1      296     123
2      356     116
3     2571     109
4      260     104

Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [146]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [125]:
filter_pattern = "quantity > 0 and country in ['Estonia', 'Latvia', 'Lithuania'] and year <=2010 and year >=2005 and category in [ 4, 12, 21]"

output = data.query(filter_pattern)

power_consum = output['quantity'].sum()

print(f'Энергопотребление стран прибалтики {power_consum} МВт в 2005 - 2010 годах.')

Энергопотребление стран прибалтики 240580.0 МВт в 2005 - 2010 годах.

еще такой вариант решения

In [161]:
consum_filtered_countries = data[ (data['country']=='Estonia') | (data['country']=='Latvia') | (data['country']=='Lithuania')]

consum_positive = consum_filtered_countries[consum_filtered_countries.quantity > 0]

consum_filtered_category = consum_positive[(consum_positive.category == 4) | (consum_positive.category == 12) | (consum_positive.category == 21)]

consum_filtered_year = consum_filtered_category[(consum_filtered_category.year >=2005) & (consum_filtered_category.year <=2010)]

total_consum = consum_filtered_year['quantity'].sum()

total_consum

240580.0

Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes

https://www.finanz.ru/valyuty/v-realnom-vremeni

In [171]:
source_url = 'https://fortrader.org/quotes'
exchange_rates = pd.read_html(source_url, encoding='utf-8')[2]
exchange_rates

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 781      -2.00         -0.00        NaN
1  Серебро Цена на серебро на бирже  26.40       0.09          0.34        NaN
2         Палладий Цена на Палладий  2 944      14.00          0.00        NaN
3           Платина Цены на платину  1 223      -1.00         -0.00        NaN
4           Медь Цена меди на бирже   4.54       0.03          0.74        NaN